packages/invoiced-support/docs/backend-dev/tests/Network/Ubl/data/output/invoice.xml

<?xml version="1.0" encoding="UTF-8"?>
<Invoice xmlns="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2"
         xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2"
         xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2">
    <cbc:ID>INV-00001</cbc:ID>
    <cbc:IssueDate>2022-11-15</cbc:IssueDate>
    <cbc:DocumentCurrencyCode>USD</cbc:DocumentCurrencyCode>
    <cac:AccountingSupplierParty>
        <cac:Party>
            <cbc:WebsiteURI>https://invoiced.com</cbc:WebsiteURI>
            <cac:PartyIdentification>
                <cbc:ID>{FROM_USERNAME}</cbc:ID>
            </cac:PartyIdentification>
            <cac:PartyName>
                <cbc:Name>TEST &amp; &lt;Corp&gt; Ara&#xFA;jo</cbc:Name>
            </cac:PartyName>
            <cac:PostalAddress>
                <cbc:CityName>Austin</cbc:CityName>
                <cbc:PostalZone>78701</cbc:PostalZone>
                <cbc:CountrySubentity>TX</cbc:CountrySubentity>
                <cac:AddressLine>
                    <cbc:Line>Company</cbc:Line>
                </cac:AddressLine>
                <cac:AddressLine>
                    <cbc:Line>Address</cbc:Line>
                </cac:AddressLine>
                <cac:Country>
                    <cbc:IdentificationCode>US</cbc:IdentificationCode>
                </cac:Country>
            </cac:PostalAddress>
            <cac:Contact>
                <cbc:Name>TEST &amp; &lt;Corp&gt; Ara&#xFA;jo</cbc:Name>
                <cbc:Telephone>12345678</cbc:Telephone>
                <cbc:ElectronicMail>test@example.com</cbc:ElectronicMail>
            </cac:Contact>
        </cac:Party>
    </cac:AccountingSupplierParty>
    <cac:AccountingCustomerParty>
        <cbc:SupplierAssignedAccountID>CUST-00001</cbc:SupplierAssignedAccountID>
        <cac:Party>
            <cac:PartyName>
                <cbc:Name>Sherlock</cbc:Name>
            </cac:PartyName>
            <cac:PostalAddress>
                <cbc:CityName>Austin</cbc:CityName>
                <cbc:PostalZone>78701</cbc:PostalZone>
                <cbc:CountrySubentity>TX</cbc:CountrySubentity>
                <cac:AddressLine>
                    <cbc:Line>Test</cbc:Line>
                </cac:AddressLine>
                <cac:AddressLine>
                    <cbc:Line>Address</cbc:Line>
                </cac:AddressLine>
                <cac:Country>
                    <cbc:IdentificationCode>US</cbc:IdentificationCode>
                </cac:Country>
            </cac:PostalAddress>
        </cac:Party>
    </cac:AccountingCustomerParty>
    <cac:LegalMonetaryTotal>
        <cbc:LineExtensionAmount currencyID="USD">100.00</cbc:LineExtensionAmount>
        <cbc:TaxExclusiveAmount currencyID="USD">100.00</cbc:TaxExclusiveAmount>
        <cbc:TaxInclusiveAmount currencyID="USD">100.00</cbc:TaxInclusiveAmount>
        <cbc:AllowanceTotalAmount currencyID="USD">0.00</cbc:AllowanceTotalAmount>
        <cbc:ChargeTotalAmount currencyID="USD">0</cbc:ChargeTotalAmount>
        <cbc:PrepaidAmount currencyID="USD">0.00</cbc:PrepaidAmount>
        <cbc:PayableRoundingAmount currencyID="USD">0</cbc:PayableRoundingAmount>
        <cbc:PayableAmount currencyID="USD">100.00</cbc:PayableAmount>
    </cac:LegalMonetaryTotal>
    <cac:InvoiceLine>
        <cbc:ID>1</cbc:ID>
        <cbc:InvoicedQuantity>1</cbc:InvoicedQuantity>
        <cbc:LineExtensionAmount currencyID="USD">100.00</cbc:LineExtensionAmount>
        <cac:Item>
            <cbc:Description>test</cbc:Description>
            <cbc:Name>Test Item</cbc:Name>
        </cac:Item>
        <cac:Price>
            <cbc:PriceAmount currencyID="USD">100.00</cbc:PriceAmount>
            <cbc:BaseQuantity>1</cbc:BaseQuantity>
        </cac:Price>
    </cac:InvoiceLine>
</Invoice>